This is a generated file for the LaTeX (2e + expl3) validation system.
Don't change this file in any respect.
%% \CharacterTable
%%  {Upper-case    \A\B\C\D\E\F\G\H\I\J\K\L\M\N\O\P\Q\R\S\T\U\V\W\X\Y\Z
%%   Lower-case    \a\b\c\d\e\f\g\h\i\j\k\l\m\n\o\p\q\r\s\t\u\v\w\x\y\z
%%   Digits        \0\1\2\3\4\5\6\7\8\9
%%   Exclamation   \!     Double quote  \"     Hash (number) \#
%%   Dollar        \$     Percent       \%     Ampersand     \&
%%   Acute accent  \'     Left paren    \(     Right paren   \)
%%   Asterisk      \*     Plus          \+     Comma         \,
%%   Minus         \-     Point         \.     Solidus       \/
%%   Colon         \:     Semicolon     \;     Less than     \<
%%   Equals        \=     Greater than  \>     Question mark \?
%%   Commercial at \@     Left bracket  \[     Backslash     \\
%%   Right bracket \]     Circumflex    \^     Underscore    \_
%%   Grave accent  \`     Left brace    \{     Vertical bar  \|
%%   Right brace   \}     Tilde         \~}
%%
Author: Frank Mittelbach
============================================================
TEST 1: 1: new + show
============================================================
! This is a LaTeX bug: check coding!
! Command name `\l_A_fp' already defined! Current meaning: macro:->0.0
For immediate help type H <return>.
 ...                                              
l.28 }
There is a coding bug somewhere around here.
This probably needs examining by an expert.
Try typing <return> to proceed.
If that doesn't work, type X <return> to quit
> \l_A_fp=macro:
->0.0.
<argument> \l_A_fp 
l.28 }
> \g_A_fp=macro:
->0.0.
<argument> \g_A_fp 
l.28 }
> \l_B_fp=macro:
->0.0.
<argument> \l_B_fp 
l.28 }
============================================================
============================================================
TEST 2: 2: set_from_dim
============================================================
> \l_A_fp=macro:
->1.0.
<argument> \l_A_fp 
l.40 }
> 0.00002pt.
<to be read again> 
                   \cs_show:N 
l.40 }
> \g_A_fp=macro:
->0.00002.
<argument> \g_A_fp 
l.40 }
============================================================
============================================================
TEST 3: 3: set_eq
============================================================
> \l_A_fp=macro:
->0.0.
<argument> \l_A_fp 
l.51 }
> \l_A_fp=macro:
->0.00002.
<argument> \l_A_fp 
l.51 }
> \g_A_fp=macro:
->0.0.
<argument> \g_A_fp 
l.51 }
============================================================
============================================================
TEST 4: 4: setting fps
============================================================
> \g_A_fp=macro:
->0.00002.
<argument> \g_A_fp 
l.66 }
> \l_A_fp=macro:
->123456789.123456789.
<argument> \l_A_fp 
l.66 }
> \l_A_fp=macro:
->123456789.123456789.
<argument> \l_A_fp 
l.66 }
! Number too big.
\l_fp_tmp_tl ->12345678901
                          .12345678901
l.66 }
I can only go up to 2147483647='17777777777="7FFFFFFF,
so I'm using that number instead of yours.
> \l_A_fp=macro:
->2147483647.123456789.
<argument> \l_A_fp 
l.66 }
============================================================
============================================================
TEST 5: 5: setting fps
============================================================
> \l_B_fp=macro:
->0.0.
<argument> \l_B_fp 
l.83 }
> \g_A_fp=macro:
->12345.123456000.
<argument> \g_A_fp 
l.83 }
> \g_A_fp=macro:
->-3.500000000.
<argument> \g_A_fp 
l.83 }
> \l_B_fp=macro:
->1.000000000.
<argument> \l_B_fp 
l.83 }
> \l_B_fp=macro:
->0.300000000.
<argument> \l_B_fp 
l.83 }
> \l_B_fp=macro:
->-0.550000000.
<argument> \l_B_fp 
l.83 }
> \l_B_fp=macro:
->-1.500000000.
<argument> \l_B_fp 
l.83 }
============================================================
============================================================
TEST 6: 6: abs
============================================================
> \l_A_fp=macro:
->5.000000000.
<argument> \l_A_fp 
l.103 }
> \l_A_fp=macro:
->5.000000000.
<argument> \l_A_fp 
l.103 }
> \l_A_fp=macro:
->6.000000000.
<argument> \l_A_fp 
l.103 }
> \l_A_fp=macro:
->15.340000000.
<argument> \l_A_fp 
l.103 }
> \l_A_fp=macro:
->0.123000000.
<argument> \l_A_fp 
l.103 }
============================================================
============================================================
TEST 7: 7: abs with arg
============================================================
> \l_A_fp=macro:
->1.200000000.
<argument> \l_A_fp 
l.115 }
> \l_B_fp=macro:
->1.200000000.
<argument> \l_B_fp 
l.115 }
> \l_A_fp=macro:
->1.123456789.
<argument> \l_A_fp 
l.115 }
============================================================
============================================================
TEST 8: 
============================================================
============================================================
============================================================
TEST 9: 
============================================================
============================================================
============================================================
TEST 10: 
============================================================
============================================================
============================================================
TEST 11: 
============================================================
============================================================
============================================================
TEST 12: 
============================================================
============================================================
============================================================
TEST 13: 
============================================================
============================================================
