This is a generated file for the LaTeX (2e + expl3) validation system.
Don't change this file in any respect.
%% \CharacterTable
%%  {Upper-case    \A\B\C\D\E\F\G\H\I\J\K\L\M\N\O\P\Q\R\S\T\U\V\W\X\Y\Z
%%   Lower-case    \a\b\c\d\e\f\g\h\i\j\k\l\m\n\o\p\q\r\s\t\u\v\w\x\y\z
%%   Digits        \0\1\2\3\4\5\6\7\8\9
%%   Exclamation   \!     Double quote  \"     Hash (number) \#
%%   Dollar        \$     Percent       \%     Ampersand     \&
%%   Acute accent  \'     Left paren    \(     Right paren   \)
%%   Asterisk      \*     Plus          \+     Comma         \,
%%   Minus         \-     Point         \.     Solidus       \/
%%   Colon         \:     Semicolon     \;     Less than     \<
%%   Equals        \=     Greater than  \>     Question mark \?
%%   Commercial at \@     Left bracket  \[     Backslash     \\
%%   Right bracket \]     Circumflex    \^     Underscore    \_
%%   Grave accent  \`     Left brace    \{     Vertical bar  \|
%%   Right brace   \}     Tilde         \~}
%%
Author: Will Robertson \& Joseph Wright
============================================================
TEST 1: new
============================================================
> .
<argument> ..._prop}\TIMO }\prop_show:N \l_a_prop 
                                                  \prop_show:c {g_b_prop}
l.27 }
> .
<recently read> \g_b_prop 
l.27 }
============================================================
============================================================
TEST 2: clear
============================================================
-\q_prop tmp\q_prop {test l\par }-
-\q_prop tmp\q_prop {test g\par }-
--
--
-\q_prop tmp\q_prop {test l\par }-
--
============================================================
============================================================
TEST 3: put
============================================================
-\q_prop tmp\par \q_prop {test l}\q_prop tmp\q_prop {test l\par }-
-\q_prop tmp\par \q_prop {test g}\q_prop tmp\q_prop {test g\par }-
-\q_prop tmp\q_prop {test l csname\par }\q_prop tmp\par \q_prop {test l}-
-\q_prop tmp\par \q_prop {test g}\q_prop tmp\q_prop {test g\par }-
--
-\q_prop tmp\par \q_prop {test g}\q_prop tmp\q_prop {test g\par }-
============================================================
============================================================
TEST 4: put_if_new
============================================================
-\q_prop test\q_prop {test a\par }-
-\q_prop test\q_prop {test b\par }-
-\q_prop test\q_prop {test b\par }-
============================================================
============================================================
TEST 5: set_eq (BROKEN)
============================================================
--
-\q_prop test\q_prop {test b\par }-
-\q_prop test\q_prop {test b\par }-
! Undefined control sequence.
<argument> ...a_prop -}\prop_gset_eq:NN \g_d_prop 
                                                  \g_b_prop \TYPE {-\the \g_...
l.91 }
The control sequence at the end of the top line
of your error message was never \def'ed. If you have
misspelled it (e.g., `\hobx'), type `I' and the correct
spelling (e.g., `I\hbox'). Otherwise just continue,
and I'll forget about whatever was undefined.
! Missing { inserted.
<to be read again> 
                   \begingroup 
l.91 }
A left brace was mandatory here, so I've put one in.
You might want to delete and/or insert some corrections
so that I will find a matching right brace soon.
(If you're confused by all this, try typing `I}' now.)
-\q_prop test\q_prop {test b\par }-
! Undefined control sequence.
<write> -\the \g_d_prop 
                        -
l.91 }
The control sequence at the end of the top line
of your error message was never \def'ed. If you have
misspelled it (e.g., `\hobx'), type `I' and the correct
spelling (e.g., `I\hbox'). Otherwise just continue,
and I'll forget about whatever was undefined.
! You can't use `the character -' after \the.
<write> -\the \g_d_prop -
l.91 }
I'm forgetting what you said and using zero instead.
-0
! Missing } inserted.
<inserted text> 
                }
l.91 }
I've inserted something that you may have forgotten.
(See the <inserted text> above.)
With luck, this will get me unwedged. But if you
really didn't forget anything, try typing `2' now; then
my insertion and my current dilemma will both disappear.
============================================================
============================================================
TEST 6: get
============================================================
macro:->##test a\par 
macro:->##test a\par 
macro:->
macro:->##test a\par 
============================================================
============================================================
TEST 7: get_gdel
============================================================
\q_prop tmpb\q_prop {##test b\par }\q_prop tmpa\q_prop {##test a\par }
! Illegal parameter number in definition of \prop_tmp:w.
<to be read again> 
                   t
l.125 }
You meant to type ## instead of #, right?
Or maybe a } was forgotten somewhere earlier, and things
are all screwed up? I'm going to assume that you meant ##.
macro:->##test a\par 
macro:->\q_no_value 
\q_prop tmpb\q_prop {##test b\par }
============================================================
============================================================
TEST 8: del
============================================================
\q_prop tmpb\q_prop {##test l b\par }\q_prop tmpa\q_prop {##test l a\par }
\q_prop tmpb\q_prop {##test g b\par }\q_prop tmpa\q_prop {##test g a\par }
! Illegal parameter number in definition of \prop_tmp:w.
<to be read again> 
                   t
l.151 }
You meant to type ## instead of #, right?
Or maybe a } was forgotten somewhere earlier, and things
are all screwed up? I'm going to assume that you meant ##.
! Illegal parameter number in definition of \prop_tmp:w.
<to be read again> 
                   t
l.151 }
You meant to type ## instead of #, right?
Or maybe a } was forgotten somewhere earlier, and things
are all screwed up? I'm going to assume that you meant ##.
! Illegal parameter number in definition of \prop_tmp:w.
<to be read again> 
                   t
l.151 }
You meant to type ## instead of #, right?
Or maybe a } was forgotten somewhere earlier, and things
are all screwed up? I'm going to assume that you meant ##.
! Illegal parameter number in definition of \prop_tmp:w.
<to be read again> 
                   t
l.151 }
You meant to type ## instead of #, right?
Or maybe a } was forgotten somewhere earlier, and things
are all screwed up? I'm going to assume that you meant ##.
\q_prop tmpb\q_prop {##test l b\par }
\q_prop tmpb\q_prop {##test g b\par }
\q_prop tmpb\q_prop {##test l b\par }\q_prop tmpa\q_prop {##test l a\par }
\q_prop tmpb\q_prop {##test g b\par }
============================================================
\q_prop tmpb\q_prop {##test g b\par }
============================================================
============================================================
TEST 9: if_empty (expect T/?/F)
============================================================
TRUE
FALSE
FALSE
============================================================
============================================================
TEST 10: if_in (expect T/T/F/F)
============================================================
TRUE
TRUE
FALSE
FALSE
============================================================
TRUE
TRUE
FALSE
FALSE
============================================================
TRUE
TRUE
FALSE
FALSE
============================================================
TRUE
TRUE
FALSE
FALSE
============================================================
============================================================
TEST 11: if_in by csname (expect F/F)
============================================================
FALSE
FALSE
============================================================
============================================================
TEST 12: if_eq (expect T/T/?)
============================================================
TRUE
TRUE
FALSE
============================================================
============================================================
TEST 13: map_function
============================================================
>b---##testb\par <
>a---##testa\par <
============================================================
============================================================
TEST 14: map_function (EXP)
============================================================
>b---testb<
>a---testa<
============================================================
============================================================
TEST 15: map_inline
============================================================
>b---##testb\par <
>a---##testa\par <
============================================================
============================================================
TEST 16: map_break
============================================================
>d---##testd\par <
>c---##testc\par <
============================================================
