This is a generated file for the LaTeX (2e + expl3) validation system.
Don't change this file in any respect.
%% \CharacterTable
%%  {Upper-case    \A\B\C\D\E\F\G\H\I\J\K\L\M\N\O\P\Q\R\S\T\U\V\W\X\Y\Z
%%   Lower-case    \a\b\c\d\e\f\g\h\i\j\k\l\m\n\o\p\q\r\s\t\u\v\w\x\y\z
%%   Digits        \0\1\2\3\4\5\6\7\8\9
%%   Exclamation   \!     Double quote  \"     Hash (number) \#
%%   Dollar        \$     Percent       \%     Ampersand     \&
%%   Acute accent  \'     Left paren    \(     Right paren   \)
%%   Asterisk      \*     Plus          \+     Comma         \,
%%   Minus         \-     Point         \.     Solidus       \/
%%   Colon         \:     Semicolon     \;     Less than     \<
%%   Equals        \=     Greater than  \>     Question mark \?
%%   Commercial at \@     Left bracket  \[     Backslash     \\
%%   Right bracket \]     Circumflex    \^     Underscore    \_
%%   Grave accent  \`     Left brace    \{     Vertical bar  \|
%%   Right brace   \}     Tilde         \~}
%%
Author: Will Robertson
============================================================
TEST 1: INTEGER
============================================================
> 1.
<argument> \tex_showthe:D \myint 
l.28   \int_show:N \myint}
============================================================
============================================================
TEST 2: DIMENSION
============================================================
> 1.0pt.
<argument> ...t:Nn \mydim {1pt}\dim_show:N \mydim 
l.32   \dim_show:N \mydim}
============================================================
============================================================
TEST 3: SKIP
============================================================
> 1.0pt plus 2.0pt minus 3.0pt.
<argument> ...lus2ptminus3pt}\skip_show:N \myskip 
l.36   \skip_show:N \myskip}
============================================================
============================================================
TEST 4: TOKS
============================================================
> ##hello$^.
<argument> ...oks {##hello$^}\toks_show:N \mytoks 
l.40   \toks_show:N \mytoks}
============================================================
============================================================
TEST 5: TL
============================================================
> \mytl=macro:
->tokens.
<argument> \mytl 
l.44   \tl_show:N \mytl}
============================================================
============================================================
TEST 6: SEQ
============================================================
> \myseq=macro:
->\seq_elt:w item2\seq_elt_end: \seq_elt:w item1\seq_elt_end: .
<argument> \myseq 
l.50   \seq_display:c {myseq}}
Sequence \myseq contains the elements (without outer braces):
>  {item2}
>  {item1}.
\seq_display:N ...N \}}}\toks_show:N \l_tmpa_toks 
l.50   \seq_display:c {myseq}}
============================================================
============================================================
TEST 7: CLIST
============================================================
> \myclist=macro:
->item2,item1.
<argument> \myclist 
l.56   \clist_display:c {myclist}}
Comma-list \myclist contains the elements (without outer braces):
>  {item2}
>  {item1}.
\clist_display:N ...\}}}\toks_show:N \l_tmpa_toks 
l.56   \clist_display:c {myclist}}
============================================================
============================================================
TEST 8: PROP
============================================================
> \q_prop key2\q_prop {val2}\q_prop key1\q_prop {val1}.
<argument> ...op {key2}{val2}\prop_show:N \myprop 
                                                  \prop_display:c {myprop}
l.62   \prop_display:c {myprop}}
Property-list \myprop contains the pairs (without outer braces):
>  {key2}  =>  {val2}
>  {key1}  =>  {val1}.
\prop_display:N ... \}}}\toks_show:N \l_tmpa_toks 
l.62   \prop_display:c {myprop}}
============================================================
