This is a generated file for the LaTeX (2e + expl3) validation system.
Don't change this file in any respect.
%% \CharacterTable
%%  {Upper-case    \A\B\C\D\E\F\G\H\I\J\K\L\M\N\O\P\Q\R\S\T\U\V\W\X\Y\Z
%%   Lower-case    \a\b\c\d\e\f\g\h\i\j\k\l\m\n\o\p\q\r\s\t\u\v\w\x\y\z
%%   Digits        \0\1\2\3\4\5\6\7\8\9
%%   Exclamation   \!     Double quote  \"     Hash (number) \#
%%   Dollar        \$     Percent       \%     Ampersand     \&
%%   Acute accent  \'     Left paren    \(     Right paren   \)
%%   Asterisk      \*     Plus          \+     Comma         \,
%%   Minus         \-     Point         \.     Solidus       \/
%%   Colon         \:     Semicolon     \;     Less than     \<
%%   Equals        \=     Greater than  \>     Question mark \?
%%   Commercial at \@     Left bracket  \[     Backslash     \\
%%   Right bracket \]     Circumflex    \^     Underscore    \_
%%   Grave accent  \`     Left brace    \{     Vertical bar  \|
%%   Right brace   \}     Tilde         \~}
%%
Author: Frank Mittelbach
============================================================
TEST 1: allocate new variables
============================================================
Defining \l_XX_tl on line 23
Defining \l_YY_tl on line 23
Defining \g_ZZ_tl on line 23
> \l_XX_tl=macro:
->.
<argument> \l_XX_tl 
l.23 }
> \l_YY_tl=macro:
->foo.
<argument> \l_YY_tl 
l.23 }
> \g_ZZ_tl=macro:
->bar.
<argument> \g_ZZ_tl 
l.23 }
============================================================
============================================================
TEST 2: use registers: expect foo bar
============================================================
foo bar
============================================================
============================================================
TEST 3: testing clear and put_left: expect ZZbar ZZbarfoo
============================================================
ZZbar ZZbarfoo
============================================================
============================================================
TEST 4: clear or allocate variables
============================================================
> \l_XX_tl=macro:
->.
<argument> \l_XX_tl 
l.59 }
> \l_aa_tl=macro:
->.
<argument> \l_aa_tl 
l.59 }
> \g_ZZ_tl=macro:
->.
<argument> \g_ZZ_tl 
l.59 }
============================================================
============================================================
TEST 5: clear inside group: expect XX <empty>
============================================================
> \l_XX_tl=macro:
->XX.
<argument> \l_XX_tl 
l.73 }
> \g_ZZ_tl=macro:
->.
<argument> \g_ZZ_tl 
l.73 }
============================================================
============================================================
TEST 6: put left/right: expect: ba!XX!12BAYY34ba!\l_XX_tl !12
============================================================
> \l_YY_tl=macro:
->ba!XX!12BAYY34ba!\l_XX_tl !12.
<argument> \l_YY_tl 
l.94 }
============================================================
============================================================
TEST 7: test \tl_to_str:N expect: ba!XX!12BAYY34ba!\l_XX_tl !12####1
============================================================
ba!XX!12BAYY34ba!\l_XX_tl !12##1
============================================================
============================================================
TEST 8: testing ##: expect 2 \ERROR ; ####1####2####3 ####1####2####1####2
============================================================
! Illegal parameter number in definition of \g_ZZ_tl.
<to be read again> 
                   1
l.117 }
You meant to type ## instead of #, right?
Or maybe a } was forgotten somewhere earlier, and things
are all screwed up? I'm going to assume that you meant ##.
! Illegal parameter number in definition of \g_ZZ_tl.
<to be read again> 
                   2
l.117 }
You meant to type ## instead of #, right?
Or maybe a } was forgotten somewhere earlier, and things
are all screwed up? I'm going to assume that you meant ##.
> \l_YY_tl=macro:
->##1##2##3.
<argument> \l_YY_tl 
l.117 }
> \g_ZZ_tl=macro:
->##1##2##1##2.
<argument> \g_ZZ_tl 
l.117 }
============================================================
============================================================
TEST 9: testing set_eq: expect abc xyz
============================================================
> \l_tmpb_tl=macro:
->abc.
<argument> \l_tmpb_tl 
l.132 }
> \g_ZZ_tl=macro:
->xyz.
<argument> \g_ZZ_tl 
l.132 }
============================================================
============================================================
TEST 10: test for empty: expect YES NO !! NO
============================================================
YES NO !! NO
============================================================
============================================================
TEST 11: test for equal: expect YES YES !! NO
============================================================
YES YES !! NO
============================================================
